<template>
    <div class="container">
    <div class="employee__header">
        <nav>
            <RouterLink to="/" class="header__element"><h5>Сотрудники</h5></RouterLink>
        </nav>
   
        <RouterLink class="header__button__wrapper" to="/employees/create">
            <button class="header__button"> 
                <span>
                    <svg class="button__icon" version="1.1" id="Capa_1" x="0px" y="0px" viewBox="0 0 461.03 461.03" style="enable-background:new 0 0 461.03 461.03;" xml:space="preserve">
                <g>
                    <g>
                        <path style="fill:#ffffff;" d="M450.619,367.004H10.57c-5.717,0-10.411,4.676-10.411,10.411c0,5.735,4.694,10.411,10.411,10.411    h440.049c5.717,0,10.411-4.676,10.411-10.411S456.354,367.004,450.619,367.004z"/>
                        <path style="fill:#ffffff;" d="M346.033,266.741h20.01v19.993c0,11.717,9.511,21.246,21.228,21.246s21.246-9.529,21.246-21.246    v-19.993h19.993c11.717,0,21.246-9.546,21.246-21.246c0-11.699-9.529-21.228-21.246-21.228h-19.993v-20.01    c0-11.699-9.529-21.228-21.246-21.228s-21.228,9.511-21.228,21.228v20.01h-20.01c-11.717,0-21.228,9.511-21.228,21.228    S334.316,266.741,346.033,266.741z M346.033,241.914h37.656v-37.656c0-3.882,7.182-3.864,7.182,0v37.656h37.638    c1.959,0,3.6,1.641,3.6,3.582c0,1.959-1.659,3.6-3.6,3.6h-37.638v37.638c0,3.882-7.182,3.9-7.182,0v-37.638h-37.656    c-1.941,0-3.582-1.659-3.582-3.6C342.451,243.555,344.092,241.914,346.033,241.914z"/>
                        <path style="fill:#ffffff;" d="M0,343.165h0.388c-0.053,0.388-0.229,0.741-0.229,1.147v1.676c0,5.276,4.323,9.582,9.582,9.582    h334.81c5.276,0,9.582-4.305,9.599-9.582v-1.676c0-0.406-0.177-0.759-0.229-1.147h0.194c-2.7-36.068-26.627-66.101-59.307-77.835    c20.592-12.458,34.815-36.968,34.815-65.465c0-40.956-29.063-74.271-64.795-74.271s-64.795,33.315-64.795,74.271    c0,28.48,14.187,52.955,34.744,65.43c-13.287,4.87-25.128,12.775-34.674,22.904c3.759,4.711,7.04,9.811,10.005,15.087    c13.182-15.652,32.645-25.763,54.702-25.763c34.639,0,63.066,24.651,70.071,57.207H221.683    c-8.682-40.109-38.415-72.136-77.253-83.958c28.251-14.452,48.067-46.938,48.067-84.753c0-51.172-36.174-92.817-80.641-92.817    c-44.485,0-80.659,41.644-80.659,92.817c0,37.797,19.799,70.283,48.049,84.735C37.638,263.406,6.017,299.086,0,343.165z     M217.678,199.864c0-31.215,21.157-56.625,47.149-56.625s47.149,25.41,47.149,56.625c0,31.233-21.14,56.643-47.149,56.643    C238.835,256.507,217.678,231.097,217.678,199.864z M48.826,166.002c0-41.45,28.268-75.171,63.013-75.171    c34.744,0,62.995,33.721,62.995,75.171s-28.251,75.171-62.995,75.171C77.094,241.173,48.826,207.452,48.826,166.002z     M111.821,263.142c44.308,0,81.205,30.562,91.829,71.589H20.01C30.616,293.704,67.513,263.142,111.821,263.142z"/>
                    </g>
                </g>
      
                </svg></span> Добавить сотрудника</button>
        </RouterLink>
    </div>
</div>
</template>

<script>
    export default {
        
    }
</script>

<style scoped>

.header__element {
    text-decoration: none;
    color: black;
    font-size: 25px;
}

.header__button__wrapper {
    text-decoration: none;

}
.header__button {
    padding: 12px;
    font-weight: 700;
    color: white;
    background-color: #5F911A;
    border-radius: 10px;
    border: none;
    display: flex;
    text-decoration: none;
    font-size: 20px;
    cursor: pointer;
}

.header__button:hover {
    background-color: #47781C;
    transition: all .7s ease;
}

.button__icon {
    display: block;
    width: 30px;
    height: 30px;
    margin: 0 10px;
    
}
.employee__header {
    display: flex;
    justify-content: space-between;
    height: 100px;
    align-items: center;
    margin-bottom: 10px;
}

.container:after{
	content: '';
	background-color: rgb(175, 175, 175, .5);
	height: 2px;
width: 100%;
	display: block;
}
</style>